; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-87)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 - objective)
 (:init 
    (at_lander general waypoint9)
    (at rover1 waypoint4)
    (at rover2 waypoint10)
    (at rover3 waypoint5)
    (at rover4 waypoint2)
    (equipped_for_soil_analysis rover4)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover1)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover1)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint7)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint8)
    (at_soil_sample waypoint10)
    (visible waypoint9 waypoint10)
    (visible waypoint6 waypoint5)
    (visible waypoint5 waypoint8)
    (visible waypoint8 waypoint7)
    (visible waypoint3 waypoint7)
    (visible waypoint2 waypoint7)
    (visible waypoint4 waypoint6)
    (visible waypoint9 waypoint3)
    (visible waypoint6 waypoint4)
    (visible waypoint1 waypoint5)
    (visible waypoint7 waypoint3)
    (visible waypoint5 waypoint1)
    (visible waypoint3 waypoint9)
    (visible waypoint5 waypoint6)
    (visible waypoint7 waypoint2)
    (visible waypoint10 waypoint9)
    (visible waypoint8 waypoint5)
    (visible waypoint7 waypoint8)
    (visible waypoint6 waypoint9)
    (visible waypoint9 waypoint6)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint1)
    (visible waypoint1 waypoint7)
    (visible waypoint7 waypoint1)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint7 waypoint9)
    (visible waypoint9 waypoint7)
    (visible waypoint7 waypoint10)
    (visible waypoint10 waypoint7)
    (visible waypoint2 waypoint9)
    (visible waypoint9 waypoint2)
    (visible waypoint5 waypoint10)
    (visible waypoint10 waypoint5)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint8 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint2 waypoint10)
    (visible waypoint10 waypoint2)
    (visible waypoint5 waypoint9)
    (visible waypoint9 waypoint5)
    (visible waypoint6 waypoint8)
    (visible waypoint8 waypoint6)
    (visible waypoint1 waypoint8)
    (visible waypoint8 waypoint1)
    (visible waypoint6 waypoint10)
    (visible waypoint10 waypoint6)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint4)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint1 waypoint10)
    (visible waypoint10 waypoint1)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (can_traverse rover1 waypoint9 waypoint10)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint5 waypoint8)
    (can_traverse rover1 waypoint8 waypoint7)
    (can_traverse rover1 waypoint3 waypoint7)
    (can_traverse rover1 waypoint2 waypoint7)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint9 waypoint3)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint7 waypoint3)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint3 waypoint9)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint7 waypoint2)
    (can_traverse rover1 waypoint10 waypoint9)
    (can_traverse rover1 waypoint8 waypoint5)
    (can_traverse rover1 waypoint7 waypoint8)
    (can_traverse rover1 waypoint6 waypoint9)
    (can_traverse rover1 waypoint9 waypoint6)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint7 waypoint9)
    (can_traverse rover1 waypoint9 waypoint7)
    (can_traverse rover1 waypoint2 waypoint9)
    (can_traverse rover1 waypoint9 waypoint2)
    (can_traverse rover1 waypoint5 waypoint10)
    (can_traverse rover1 waypoint10 waypoint5)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover1 waypoint1 waypoint8)
    (can_traverse rover1 waypoint8 waypoint1)
    (can_traverse rover1 waypoint3 waypoint6)
    (can_traverse rover1 waypoint6 waypoint3)
    (can_traverse rover2 waypoint9 waypoint10)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint5 waypoint8)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint2 waypoint7)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint9 waypoint3)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint5 waypoint1)
    (can_traverse rover2 waypoint3 waypoint9)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint7 waypoint2)
    (can_traverse rover2 waypoint10 waypoint9)
    (can_traverse rover2 waypoint8 waypoint5)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint8 waypoint9)
    (can_traverse rover2 waypoint9 waypoint8)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint6 waypoint8)
    (can_traverse rover2 waypoint8 waypoint6)
    (can_traverse rover2 waypoint1 waypoint8)
    (can_traverse rover2 waypoint8 waypoint1)
    (can_traverse rover2 waypoint6 waypoint10)
    (can_traverse rover2 waypoint10 waypoint6)
    (can_traverse rover2 waypoint3 waypoint6)
    (can_traverse rover2 waypoint6 waypoint3)
    (can_traverse rover3 waypoint9 waypoint10)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint5 waypoint8)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint3 waypoint7)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint9 waypoint3)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint7 waypoint3)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint3 waypoint9)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint7 waypoint2)
    (can_traverse rover3 waypoint10 waypoint9)
    (can_traverse rover3 waypoint8 waypoint5)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint7 waypoint10)
    (can_traverse rover3 waypoint10 waypoint7)
    (can_traverse rover3 waypoint5 waypoint10)
    (can_traverse rover3 waypoint10 waypoint5)
    (can_traverse rover3 waypoint8 waypoint9)
    (can_traverse rover3 waypoint9 waypoint8)
    (can_traverse rover3 waypoint2 waypoint10)
    (can_traverse rover3 waypoint10 waypoint2)
    (can_traverse rover3 waypoint5 waypoint9)
    (can_traverse rover3 waypoint9 waypoint5)
    (can_traverse rover3 waypoint1 waypoint8)
    (can_traverse rover3 waypoint8 waypoint1)
    (can_traverse rover3 waypoint6 waypoint10)
    (can_traverse rover3 waypoint10 waypoint6)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover4 waypoint9 waypoint10)
    (can_traverse rover4 waypoint6 waypoint5)
    (can_traverse rover4 waypoint5 waypoint8)
    (can_traverse rover4 waypoint8 waypoint7)
    (can_traverse rover4 waypoint3 waypoint7)
    (can_traverse rover4 waypoint2 waypoint7)
    (can_traverse rover4 waypoint4 waypoint6)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint6 waypoint4)
    (can_traverse rover4 waypoint1 waypoint5)
    (can_traverse rover4 waypoint7 waypoint3)
    (can_traverse rover4 waypoint5 waypoint1)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint5 waypoint6)
    (can_traverse rover4 waypoint7 waypoint2)
    (can_traverse rover4 waypoint10 waypoint9)
    (can_traverse rover4 waypoint8 waypoint5)
    (can_traverse rover4 waypoint7 waypoint8)
    (can_traverse rover4 waypoint1 waypoint2)
    (can_traverse rover4 waypoint2 waypoint1)
    (can_traverse rover4 waypoint7 waypoint10)
    (can_traverse rover4 waypoint10 waypoint7)
    (can_traverse rover4 waypoint4 waypoint7)
    (can_traverse rover4 waypoint7 waypoint4)
    (calibration_target camera1 objective5)
    (on_board camera1 rover3)
    (supports camera1 high_res)
    (supports camera1 low_res)
    (calibration_target camera2 objective2)
    (on_board camera2 rover3)
    (supports camera2 high_res)
    (supports camera2 low_res)
    (calibration_target camera3 objective6)
    (on_board camera3 rover1)
    (supports camera3 high_res)
    (supports camera3 low_res)
    (supports camera3 colour)
    (calibration_target camera4 objective3)
    (on_board camera4 rover3)
    (supports camera4 colour)
    (supports camera4 low_res)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint10)
    (visible_from objective1 waypoint8)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint4)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint6)
    (visible_from objective3 waypoint7)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint10)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint9)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint8)
    (visible_from objective4 waypoint2)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint9)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint10)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint1)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint2)
    (visible_from objective7 waypoint10)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint5)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint5)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint8)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint9)
    (visible_from objective9 waypoint8)
    (visible_from objective9 waypoint4)
    (visible_from objective9 waypoint7)
    (visible_from objective9 waypoint6)
    (visible_from objective9 waypoint5))
 (:goal (and 
(communicated_soil_data waypoint1)
(communicated_soil_data waypoint10)
(communicated_rock_data waypoint3)
(communicated_rock_data waypoint7)
(communicated_image_data objective2 colour)
))
)

; plan
1. (navigate rover4 waypoint2 waypoint1)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint1)
   goals met: 0 of 5
2. (sample_soil rover4 rover4store waypoint1)
   deleted: (empty rover4store) (at_soil_sample waypoint1)
   added: (full rover4store) (have_soil_analysis rover4 waypoint1)
   goals met: 0 of 5
3. (navigate rover4 waypoint1 waypoint2)
   deleted: (at rover4 waypoint1)
   added: (at rover4 waypoint2)
   goals met: 0 of 5
4. (communicate_soil_data rover4 general waypoint1 waypoint2 waypoint9)
   added: (communicated_soil_data waypoint1)
   goals met: 1 of 5
5. (sample_soil rover2 rover2store waypoint10)
   deleted: (empty rover2store) (at_soil_sample waypoint10)
   added: (full rover2store) (have_soil_analysis rover2 waypoint10)
   goals met: 1 of 5
6. (communicate_soil_data rover2 general waypoint10 waypoint10 waypoint9)
   added: (communicated_soil_data waypoint10)
   goals met: 2 of 5
7. (navigate rover3 waypoint5 waypoint10)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint10)
   goals met: 2 of 5
8. (calibrate rover1 camera3 objective6 waypoint4)
   added: (calibrated camera3 rover1)
   goals met: 2 of 5
9. (take_image rover1 waypoint4 objective2 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 colour)
   goals met: 2 of 5
10. (navigate rover1 waypoint4 waypoint6)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint6)
   goals met: 2 of 5
11. (navigate rover1 waypoint6 waypoint3)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint3)
   goals met: 2 of 5
12. (communicate_image_data rover1 general objective2 colour waypoint3 waypoint9)
   added: (communicated_image_data objective2 colour)
   goals met: 3 of 5
13. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover1 waypoint3) (full rover1store)
   goals met: 3 of 5
14. (communicate_rock_data rover1 general waypoint3 waypoint3 waypoint9)
   added: (communicated_rock_data waypoint3)
   goals met: 4 of 5
15. (navigate rover3 waypoint10 waypoint7)
   deleted: (at rover3 waypoint10)
   added: (at rover3 waypoint7)
   goals met: 4 of 5
16. (sample_rock rover3 rover3store waypoint7)
   deleted: (empty rover3store) (at_rock_sample waypoint7)
   added: (have_rock_analysis rover3 waypoint7) (full rover3store)
   goals met: 4 of 5
17. (communicate_rock_data rover3 general waypoint7 waypoint7 waypoint9)
   added: (communicated_rock_data waypoint7)
   goals met: 5 of 5
